html/elisp/introduction/variable.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>变量</title>
<meta name="author" content="Wu, Shanliang" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="css/main.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="elisp.html"> UP </a>
 |
 <a accesskey="H" href="elisp.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">变量</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org3ddec3c">buffer local 变量</a></li>
<li><a href="#orga4bd8ca">作用域</a>
<ul>
<li><a href="#org21cff47">生存期</a></li>
</ul>
</li>
<li><a href="#org9b46e0c">命名习惯</a></li>
<li><a href="#orgcfd3d4f">其它函数</a></li>
</ul>
</div>
</div>
<pre class="example" id="org47b8b8b">
在此之前，已经见过 elisp 中的两种变量，全局变量和 let 绑定的局部变量。它们相当于其它语言中的全局变量和局部变量
</pre>

<p>
关于 let 绑定的变量，有两点需要补充的：
</p>
<ul class="org-ul">
<li>当同一个变量名既是全局变量也是局部变量，或者用 let 多层绑定，只有最里层的那个变量是有效的，用 setq 改变的也只是最里层的变量，而不影响外层的变量</li>
</ul>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #696969;">(</span><span style="color: #00ffff;">progn</span>
  <span style="color: #696969;">(</span>setq foo <span style="color: #ffa07a;">"I'm global variable!"</span><span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #00ffff;">let</span> <span style="color: #696969;">((</span>foo 5<span style="color: #696969;">))</span>
    <span style="color: #696969;">(</span>message <span style="color: #ffa07a;">"foo value is: %S"</span> foo<span style="color: #696969;">)</span>
    <span style="color: #696969;">(</span><span style="color: #00ffff;">let</span> <span style="color: #696969;">(</span>foo<span style="color: #696969;">)</span>
      <span style="color: #696969;">(</span>setq foo <span style="color: #ffa07a;">"I'm local variable!"</span><span style="color: #696969;">)</span>
      <span style="color: #696969;">(</span>message foo<span style="color: #696969;">))</span>
    <span style="color: #696969;">(</span>message <span style="color: #ffa07a;">"foo value is still: %S"</span> foo<span style="color: #696969;">))</span>
  <span style="color: #696969;">(</span>message foo<span style="color: #696969;">))</span>
</pre>
</div>

<ul class="org-ul">
<li>局部变量的绑定不能超过一定的层数，也就是说，不能把 foo 用 let 绑定 10000 层</li>
</ul>

<pre class="example" id="org050df08">
当然普通的函数是不可能写成这样的，但是递归函数就不一定了

限制层数的变量在 max-specpdl-size 中定义。如果你写的递归函数有这个需要的话，可以先设置这个变量的值
</pre>

<p>
emacs 有一种特殊的局部变量： <span class="underline">buffer-local</span> 变量
</p>
<div id="outline-container-org3ddec3c" class="outline-2">
<h2 id="org3ddec3c">buffer local 变量</h2>
<div class="outline-text-2" id="text-org3ddec3c">
<pre class="example" id="org96e5f3a">
emacs 能有如此丰富的模式，各个缓冲区之间能不相互冲突，很大程度上要归功于 buffer-local 变量
</pre>

<p>
<b>声明</b> 一个 buffer-local 的变量可以用 <span class="underline">make-variable-buffer-local</span> 或用 <span class="underline">make-local-variable</span> ：
</p>
<ul class="org-ul">
<li>前者是相当于在所有buffer中都产生一个 buffer-local 的变量</li>
<li>后者只在声明时所在的缓冲区内产生一个局部变量，而其它缓冲区仍然使用的是全局变量</li>
</ul>

<pre class="example" id="org9e03566">
一般来说推荐使用 make-local-variable 

为了方便演示，下面的代码我假定你是在 *scratch* 缓冲区里运行 
</pre>

<p>
先介绍两个用到的表达式（ with-current-buffer 其实是一个宏）。
</p>

<p>
<span class="underline">with-current-buffer</span> 的使用形式，其中 buffer 可以是一个缓冲区对象，也可以是缓冲区的名字。它的作用是使其中的 body 表达式在指定的缓冲区里执行 
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #696969;">(</span><span style="color: #00ffff;">with-current-buffer</span> buffer
  body<span style="color: #696969;">)</span>
</pre>
</div>

<p>
<span class="underline">get-buffer</span> 可以用缓冲区的名字得到对应的缓冲区对象。如果没有这样名字的缓冲区会返回 nil 
</p>

<p>
下面是使用 buffer-local 变量的例子：
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #696969;">(</span>setq foo <span style="color: #ffa07a;">"I'm global variable!"</span><span style="color: #696969;">)</span>       <span style="color: #ff4500;">; =&gt; "I'm global variable!"</span>
<span style="color: #696969;">(</span>make-local-variable 'foo<span style="color: #696969;">)</span>              <span style="color: #ff4500;">; =&gt; foo</span>
foo                                     <span style="color: #ff4500;">; =&gt; "I'm global variable!"</span>
<span style="color: #696969;">(</span>setq foo <span style="color: #ffa07a;">"I'm buffer-local variable!"</span><span style="color: #696969;">)</span> <span style="color: #ff4500;">; =&gt; "I'm buffer-local variable!"</span>
foo                                  <span style="color: #ff4500;">; =&gt; "I'm buffer-local variable!"</span>
<span style="color: #696969;">(</span><span style="color: #00ffff;">with-current-buffer</span> <span style="color: #ffa07a;">"*Messages*"</span> foo<span style="color: #696969;">)</span>  <span style="color: #ff4500;">; =&gt; "I'm global variable!"</span>
</pre>
</div>

<p>
当一个符号作为全局变量时有一个值的话，用 make-local-variable 声明为 buffer-local 变量时，这个变量的值还是全局变量的值。这时候全局的值也称为 <span class="underline">缺省值</span> 。可以用 <span class="underline">default -value</span> 来访问这个符号的全局变量的值
</p>

<pre class="example" id="org2c57c28">
(default-value 'foo)                    ; =&gt; "I'm global variable!"
</pre>

<p>
如果一个变量是 buffer-local：
</p>
<ul class="org-ul">
<li>那么在这个缓冲区内使用 <span class="underline">setq</span> 就只能用改变 <span class="underline">当前缓冲区里这个变量的值</span></li>
<li><span class="underline">setq-default</span> 可以修改符号作为全局变量的值</li>
</ul>

<pre class="example" id="orgc5d198f">
通常在 .emacs 里经常使用 setq，这样可以防止修改的是导入 .emacs 文件对应的缓冲区里的 buffer-local 变量，而不是设置全局的值
</pre>

<p>
测试一个变量是不是 buffer-local 可以用 <span class="underline">local-variable-p</span> 
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #696969;">(</span>local-variable-p 'foo<span style="color: #696969;">)</span>                           <span style="color: #ff4500;">; =&gt; t</span>
<span style="color: #696969;">(</span>local-variable-p 'foo <span style="color: #696969;">(</span>get-buffer <span style="color: #ffa07a;">"*Messages*"</span><span style="color: #696969;">))</span> <span style="color: #ff4500;">; =&gt; nil</span>
</pre>
</div>

<p>
如果要在当前缓冲区里得到其它缓冲区的 buffer-local 变量可以用 <span class="underline">buffer-local-value</span> 
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #696969;">(</span><span style="color: #00ffff;">with-current-buffer</span> <span style="color: #ffa07a;">"*Messages*"</span>
  <span style="color: #696969;">(</span>buffer-local-value 'foo <span style="color: #696969;">(</span>get-buffer <span style="color: #ffa07a;">"*scratch*"</span><span style="color: #696969;">)))</span>
                    <span style="color: #ff4500;">; =&gt; "I'm buffer local variable!"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orga4bd8ca" class="outline-2">
<h2 id="orga4bd8ca">作用域</h2>
<div class="outline-text-2" id="text-orga4bd8ca">
<p>
现在已经学习这样几种变量：
</p>
<ul class="org-ul">
<li>全局变量</li>
<li>buffer-local 变量</li>
<li>let 绑定局部变量</li>
</ul>

<pre class="example" id="org66b08ad">
如果还要考虑函数的参数列表声明的变量，也就是 4 种类型的变量

那各种变量的作用范围(scope)和生存期（extent）分别是怎样的呢？
</pre>

<p>
<span class="underline">作用域</span> （scope）是指 <b>变量在代码中能够访问的位置</b> 。emacs lisp 这种绑定称为 <span class="underline">indefinite scope</span> ：
</p>
<ul class="org-ul">
<li><span class="underline">indefinite</span> scope 也就是说可以在 <b>任何位置</b> 都可能访问一个变量名</li>
<li><span class="underline">lexical</span>  scope（词法作用域）指局部变量只能作用在 <b>函数中和一个块里</b></li>
</ul>

<pre class="example" id="org853c08c">
比如 let 绑定和函数参数列表的变量在整个表达式内都是可见的，这有别于其它语言词法作用域的变量

这也是emacs经常被诟病的地方！！！
</pre>

<p>
先看下面这个例子：
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #696969;">(</span><span style="color: #00ffff;">defun</span> <span style="color: #87cefa;">binder</span> <span style="color: #696969;">(</span>x<span style="color: #696969;">)</span>                      <span style="color: #ff4500;">; `</span><span style="color: #7fffd4;">x</span><span style="color: #ff4500;">' is bound in `</span><span style="color: #7fffd4;">binder</span><span style="color: #ff4500;">'.</span>
  <span style="color: #696969;">(</span>foo 5<span style="color: #696969;">))</span>                             <span style="color: #ff4500;">; `</span><span style="color: #7fffd4;">foo</span><span style="color: #ff4500;">' is some other function.</span>

<span style="color: #696969;">(</span><span style="color: #00ffff;">defun</span> <span style="color: #87cefa;">user</span> <span style="color: #696969;">()</span>                         <span style="color: #ff4500;">; `</span><span style="color: #7fffd4;">x</span><span style="color: #ff4500;">' is used "free" in `</span><span style="color: #7fffd4;">user</span><span style="color: #ff4500;">'.</span>
  <span style="color: #696969;">(</span>list x<span style="color: #696969;">))</span>

<span style="color: #696969;">(</span><span style="color: #00ffff;">defun</span> <span style="color: #87cefa;">foo</span> <span style="color: #696969;">(</span>ignore<span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span>user<span style="color: #696969;">))</span>

<span style="color: #696969;">(</span>binder 10<span style="color: #696969;">)</span>                            <span style="color: #ff4500;">; =&gt; (10)</span>
</pre>
</div>

<pre class="example" id="orgb5374de">
对于词法作用域的语言，在 user 函数里无论如何是不能访问 binder 函数中绑定的 x。但是在 elisp 中可以
</pre>
</div>

<div id="outline-container-org21cff47" class="outline-3">
<h3 id="org21cff47">生存期</h3>
<div class="outline-text-3" id="text-org21cff47">
<p>
生存期是指程序运行过程中，变量什么时候是有效的：
</p>
<ul class="org-ul">
<li>全局变量和 buffer-local 变量都是始终存在的
<ul class="org-ul">
<li>全局变量：只能当关闭emacs 或者用 <span class="underline">unintern</span> 从 obarray 里除去时才能消除</li>
<li>buffer-local 的变量：只能关闭缓冲区或者用 <span class="underline">kill-local-variable</span> 才会消失</li>
</ul></li>
<li>局部变量 emacs lisp 使用的方式称为动态生存期：只有当绑定了这个变量的表达式运行时才是有效的</li>
</ul>

<pre class="example" id="org55c222e">
这和 C 和 Pascal 里的 Local 和automatic 变量是一样的

与此相对的是 indefinite extent，变量即使离开绑定它的表达式还能有效
</pre>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #696969;">(</span><span style="color: #00ffff;">defun</span> <span style="color: #87cefa;">make-add</span> <span style="color: #696969;">(</span>n<span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span>function <span style="color: #696969;">(</span><span style="color: #00ffff;">lambda</span> <span style="color: #696969;">(</span>m<span style="color: #696969;">)</span> <span style="color: #696969;">(</span>+ n m<span style="color: #696969;">))))</span>      <span style="color: #ff4500;">; Return a function.</span>

<span style="color: #696969;">(</span>fset 'add2 <span style="color: #696969;">(</span>make-add 2<span style="color: #696969;">))</span>               <span style="color: #ff4500;">; Define function `</span><span style="color: #7fffd4;">add2</span><span style="color: #ff4500;">'</span>
                                        <span style="color: #ff4500;">;   with `(make-add 2)'.</span>

<span style="color: #696969;">(</span>add2 4<span style="color: #696969;">)</span>                                <span style="color: #ff4500;">; Try to add 2 to 4.</span>
</pre>
</div>

<pre class="example" id="orge3975ca">
注意：其它 Lisp 方言中有闭包，但是 emacs lisp 中没有
</pre>

<p>
说完这些概念，可能还是一点雾水。一个判断变量是否有效的方法吧：
</p>
<ol class="org-ol">
<li>看看包含这个变量的 form 中是否有 let 绑定这个局部变量。如果这个 form 不是在定义一个函数，则跳到第 3 步</li>
<li>如果是在定义函数，则不仅要看这个函数的参数中是否有这个变量，而且还要看所有直接或间接调用这个函数的函数中是否有用 let 绑定或者参数列表里有这个变量名</li>
<li>看这个变量是否是一个全局变量或者是 buffer-local 变量</li>
</ol>

<pre class="example" id="orgf7404e0">
永远无法判断一个函数中出现的没有用 let 绑定，也不在参数列表中的变量是否是没有定义过的

但是一般来说这不是一个好习惯
</pre>

<p>
对于在一个函数中绑定一个变量，而在另一个函数中还在使用，manual 里认为这两个种情况下是比较好的：
</p>
<ul class="org-ul">
<li>这个变量只有相关的几个函数中使用，在 <b>一个文件中放在一起</b> 。这个变量起程序里通信的作用。而且需要写好注释告诉其它程序员怎样使用它</li>
<li>如果这个变量是定义明确、有很好文档作用的，可能让所有函数使用它，但是 <b>不要设置它</b> 。比如 case-fold-search</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org9b46e0c" class="outline-2">
<h2 id="org9b46e0c">命名习惯</h2>
<div class="outline-text-2" id="text-org9b46e0c">
<p>
对于变量的命名，有一些习惯，这样可以从变量名就能看出变量的用途：
</p>
<ul class="org-ul">
<li>hook 一个在特定情况下调用的函数列表，比如关闭缓冲区时，进入某个模式时</li>
<li>function 值为一个函数</li>
<li>functions 值为一个函数列表</li>
<li>flag 值为 nil 或 non-nil</li>
<li>predicate 值是一个作判断的函数，返回 nil 或 non-nil</li>
<li>program 或 -command 一个程序或 shell 命令名</li>
<li>form 一个表达式</li>
<li>forms 一个表达式列表</li>
<li>map 一个按键映射（keymap）</li>
</ul>
</div>
</div>

<div id="outline-container-orgcfd3d4f" class="outline-2">
<h2 id="orgcfd3d4f">其它函数</h2>
<div class="outline-text-2" id="text-orgcfd3d4f">
<p>
一个符号如果值为空，直接使用可能会产生一个错误。可以用 <span class="underline">boundp</span> 来测试一个变量是否有定义
</p>
<pre class="example" id="org02af655">
这通常用于 elisp 扩展的移植（用于不同版本或 XEmacs）
</pre>
<p>
对于一个 buffer-local 变量，它的缺省值可能是没有定义的，这时用 default-value 函数可能会出错。这时就先用 <span class="underline">default-boundp</span> 先进行测试 
</p>

<ul class="org-ul">
<li>使一个变量的值重新为空，可以用 <span class="underline">makunbound</span></li>
<li>要消除一个 buffer-local 变量用函数 <span class="underline">kill-local-variable</span></li>
<li>可以用 <span class="underline">kill-all-local-variables</span> 消除所有的 buffer-local 变量
<ul class="org-ul">
<li>但是有属性 permanent-local 的不会消除，带有这些标记的变量一般都是和缓冲区模式无关的，比如输入法</li>
</ul></li>
</ul>

<div class="org-src-container">
<pre class="src src-lisp">foo                                     <span style="color: #ff4500;">; =&gt; "I'm local variable!"</span>
<span style="color: #696969;">(</span>boundp 'foo<span style="color: #696969;">)</span>                           <span style="color: #ff4500;">; =&gt; t</span>
<span style="color: #696969;">(</span>default-boundp 'foo<span style="color: #696969;">)</span>                   <span style="color: #ff4500;">; =&gt; t</span>
<span style="color: #696969;">(</span>makunbound 'foo<span style="color: #696969;">)</span>                       <span style="color: #ff4500;">; =&gt; foo</span>
foo                                     <span style="color: #ff4500;">; This will signal an error</span>
<span style="color: #696969;">(</span>default-boundp 'foo<span style="color: #696969;">)</span>                   <span style="color: #ff4500;">; =&gt; t</span>
<span style="color: #696969;">(</span>kill-local-variable 'foo<span style="color: #696969;">)</span>              <span style="color: #ff4500;">; =&gt; foo</span>
</pre>
</div>

<p>
<a href="function.html">Next：函数和命令</a>
</p>

<p>
<a href="evalution.html">Previous：求值</a>
</p>

<p>
<a href="elisp.html">Home：目录</a>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">

		  <br/>
		  <div class='ds-thread'></div>
		  <script>
		  var duoshuoQuery = {short_name:'klose911'};
		  (function() {
					  var dsThread = document.getElementsByClassName('ds-thread')[0];
					  dsThread.setAttribute('data-thread-key', document.title);
					  dsThread.setAttribute('data-title', document.title);
					  dsThread.setAttribute('data-url', window.location.href);
					  var ds = document.createElement('script');
					  ds.type = 'text/javascript';ds.async = true;
					  ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
					  ds.charset = 'UTF-8';
					  (document.getElementsByTagName('head')[0] 
						|| document.getElementsByTagName('body')[0]).appendChild(ds);
					  })();
		  </script>
		  <script>
		  (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
			(i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
			m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
			})(window,document,'script','https://www.google-analytics.com/analytics.js','ga');
		  ga('create', 'UA-90850421-1', 'auto');
		  ga('send', 'pageview');
		  </script>
</div>
</body>
</html>
